GopalSaraf/Practicals/PSDL/include/legacy/pic16f91x_legacy.h

#ifndef	_HTC_H_
#warning Header file pic16f91x.h included directly. Use #include <htc.h> instead.
#endif


 /* header file for the MICROCHIP PIC microcontrollers
	PIC16F913
	PIC16F914
	PIC16F916
	PIC16F917
 */

#ifndef	__PIC16F91X_H
#define	__PIC16F91X_H

// Special function register definitions

volatile       unsigned char	INDF		__at(0x00);
volatile       unsigned char	TMR0		__at(0x01);
volatile       unsigned char	PCL		__at(0x02);
volatile       unsigned char	STATUS		__at(0x03);
volatile	unsigned char	FSR		__at(0x04);
volatile       unsigned char	PORTA		__at(0x05);
volatile       unsigned char	PORTB		__at(0x06);
volatile       unsigned char	PORTC		__at(0x07);
#if defined(_16F914) || defined(_16F917)
volatile       unsigned char	PORTD		__at(0x08);
#endif
volatile       unsigned char	PORTE		__at(0x09);
volatile       unsigned char	PCLATH		__at(0x0A);
volatile       unsigned char	INTCON		__at(0x0B);
volatile       unsigned char	PIR1		__at(0x0C);
volatile       unsigned char	PIR2		__at(0x0D);
volatile       unsigned char	TMR1L		__at(0x0E);
volatile       unsigned char	TMR1H		__at(0x0F);
volatile       unsigned char	T1CON		__at(0x10);
volatile       unsigned char	TMR2		__at(0x11);
volatile       unsigned char	T2CON		__at(0x12);
volatile       unsigned char	SSPBUF		__at(0x13);
volatile       unsigned char	SSPCON		__at(0x14);
volatile       unsigned char	CCPR1L		__at(0x15);
volatile       unsigned char	CCPR1H		__at(0x16);
volatile       unsigned char	CCP1CON		__at(0x17);
volatile       unsigned char	RCSTA		__at(0x18);
volatile       unsigned char	TXREG		__at(0x19);
volatile       unsigned char	RCREG		__at(0x1A);
#if defined(_16F914) || defined(_16F917)
volatile       unsigned char	CCPR2L		__at(0x1B);
volatile       unsigned char	CCPR2H		__at(0x1C);
volatile       unsigned char	CCP2CON		__at(0x1D);
#endif
volatile       unsigned char	ADRESH		__at(0x1E);
volatile       unsigned char	ADCON0		__at(0x1F);
volatile	unsigned char	OPTION		__at(0x81);
volatile       unsigned char	TRISA		__at(0x85);
volatile       unsigned char	TRISB		__at(0x86);
volatile       unsigned char	TRISC		__at(0x87);
#if defined(_16F914) || defined(_16F917)
volatile       unsigned char	TRISD		__at(0x88);
#endif
volatile       unsigned char	TRISE		__at(0x89);
volatile	unsigned char	PIE1		__at(0x8C);
volatile	unsigned char	PIE2		__at(0x8D);
volatile       unsigned char	PCON		__at(0x8E);
volatile       unsigned char	OSCCON		__at(0x8F);
volatile	unsigned char	OSCTUNE		__at(0x90);
volatile	unsigned char	ANSEL		__at(0x91);
volatile	unsigned char	PR2		__at(0x92);
volatile	unsigned char	SSPADD		__at(0x93);
volatile       unsigned char	SSPSTAT		__at(0x94);
volatile	unsigned char	WPUB		__at(0x95);
volatile	unsigned char	IOCB		__at(0x96);
volatile	unsigned char	CMCON1		__at(0x97);
volatile       unsigned char	TXSTA		__at(0x98);
volatile	unsigned char	SPBRG		__at(0x99);
volatile       unsigned char	CMCON0		__at(0x9C);
volatile	unsigned char	VRCON		__at(0x9D);
volatile       unsigned char	ADRESL		__at(0x9E);
volatile	unsigned char	ADCON1		__at(0x9F);
volatile       unsigned char	WDTCON		__at(0x105);
volatile       unsigned char	LCDCON		__at(0x107);
volatile       unsigned char	LCDPS		__at(0x108);
volatile       unsigned char	LVDCON		__at(0x109);
volatile       unsigned char	EEDATL		__at(0x10C);
/* Alternate definition for backward compatibility */
volatile       unsigned char	EEDATA		__at(0x10C);
volatile       unsigned char	EEADRL		__at(0x10D);
/* Alternate definition for backward compatibility */
volatile       unsigned char	EEADR		__at(0x10D);
volatile       unsigned char	EEDATH		__at(0x10E);
volatile       unsigned char	EEADRH		__at(0x10F);
volatile	unsigned char	LCDDATA0	__at(0x110);
volatile	unsigned char	LCDDATA1	__at(0x111);
#if defined(_16F914) || defined(_16F917)
volatile	unsigned char	LCDDATA2	__at(0x112);
#endif
volatile	unsigned char	LCDDATA3	__at(0x113);
volatile	unsigned char	LCDDATA4	__at(0x114);
#if defined(_16F914) || defined(_16F917)
volatile	unsigned char	LCDDATA5	__at(0x115);
#endif
volatile	unsigned char	LCDDATA6	__at(0x116);
volatile	unsigned char	LCDDATA7	__at(0x117);
#if defined(_16F914) || defined(_16F917)
volatile	unsigned char	LCDDATA8	__at(0x118);
#endif
volatile	unsigned char	LCDDATA9	__at(0x119);
volatile	unsigned char	LCDDATA10	__at(0x11A);
#if defined(_16F914) || defined(_16F917)
volatile	unsigned char	LCDDATA11	__at(0x11B);
#endif
volatile	unsigned char	LCDSE0		__at(0x11C);
volatile	unsigned char	LCDSE1		__at(0x11D);
volatile	unsigned char	LCDSE2		__at(0x11E);
volatile       unsigned char	EECON1		__at(0x18C);
volatile       unsigned char	EECON2		__at(0x18D);


/* Definitions for STATUS register */
volatile       __bit	CARRY		__at((0x03*8)+0);
volatile       __bit	DC		__at((0x03*8)+1);
volatile       __bit	ZERO		__at((0x03*8)+2);
volatile       __bit	PD		__at((0x03*8)+3);
volatile       __bit	TO		__at((0x03*8)+4);
volatile	__bit	RP0		__at((0x03*8)+5);
volatile	__bit	RP1		__at((0x03*8)+6);
volatile	__bit	IRP		__at((0x03*8)+7);

/* Definitions for PORTA register */
volatile       __bit	RA0		__at((0x05*8)+0);
volatile       __bit	RA1		__at((0x05*8)+1);
volatile       __bit	RA2		__at((0x05*8)+2);
volatile       __bit	RA3		__at((0x05*8)+3);
volatile       __bit	RA4		__at((0x05*8)+4);
volatile       __bit	RA5		__at((0x05*8)+5);
volatile       __bit	RA6		__at((0x05*8)+6);
volatile       __bit	RA7		__at((0x05*8)+7);

/* Definitions for PORTB register */
volatile       __bit	RB0		__at((0x06*8)+0);
volatile       __bit	RB1		__at((0x06*8)+1);
volatile       __bit	RB2		__at((0x06*8)+2);
volatile       __bit	RB3		__at((0x06*8)+3);
volatile       __bit	RB4		__at((0x06*8)+4);
volatile       __bit	RB5		__at((0x06*8)+5);
volatile       __bit	RB6		__at((0x06*8)+6);
volatile       __bit	RB7		__at((0x06*8)+7);

/* Definitions for PORTC register */
volatile       __bit	RC0		__at((0x07*8)+0);
volatile       __bit	RC1		__at((0x07*8)+1);
volatile       __bit	RC2		__at((0x07*8)+2);
volatile       __bit	RC3		__at((0x07*8)+3);
volatile       __bit	RC4		__at((0x07*8)+4);
volatile       __bit	RC5		__at((0x07*8)+5);
volatile       __bit	RC6		__at((0x07*8)+6);
volatile       __bit	RC7		__at((0x07*8)+7);

#if defined(_16F914) || defined(_16F917)
/* Definitions for PORTD register */
volatile       __bit	RD0		__at((0x08*8)+0);
volatile       __bit	RD1		__at((0x08*8)+1);
volatile       __bit	RD2		__at((0x08*8)+2);
volatile       __bit	RD3		__at((0x08*8)+3);
volatile       __bit	RD4		__at((0x08*8)+4);
volatile       __bit	RD5		__at((0x08*8)+5);
volatile       __bit	RD6		__at((0x08*8)+6);
volatile       __bit	RD7		__at((0x08*8)+7);

/* Definitions for PORTE register */
volatile       __bit	RE0		__at((0x09*8)+0);
volatile       __bit	RE1		__at((0x09*8)+1);
volatile       __bit	RE2		__at((0x09*8)+2);
#endif
volatile       __bit	RE3		__at((0x09*8)+3);

