GopalSaraf/Practicals/PSDL/include/legacy/pic16f91x_legacy.h
/* Definitions for INTCON register */
volatile       __bit	RBIF		__at((0x0B*8)+0);
volatile       __bit	INTF		__at((0x0B*8)+1);
volatile       __bit	T0IF		__at((0x0B*8)+2);
volatile	__bit	RBIE		__at((0x0B*8)+3);
volatile	__bit	INTE		__at((0x0B*8)+4);
volatile	__bit	T0IE		__at((0x0B*8)+5);
volatile	__bit	PEIE		__at((0x0B*8)+6);
volatile __bit	GIE		__at((0x0B*8)+7);

/* Definitions for PIR1 register */
volatile       __bit	TMR1IF		__at((0x0C*8)+0);
volatile       __bit	TMR2IF		__at((0x0C*8)+1);
volatile       __bit	CCP1IF		__at((0x0C*8)+2);
volatile       __bit	SSPIF		__at((0x0C*8)+3);
volatile       __bit	TXIF		__at((0x0C*8)+4);
volatile       __bit	RCIF		__at((0x0C*8)+5);
volatile       __bit	ADIF		__at((0x0C*8)+6);
volatile       __bit	EEIF		__at((0x0C*8)+7);

/* Definitions for PIR2 register */
volatile       __bit	CCP2IF		__at((0x0D*8)+0);
volatile       __bit	LVDIF		__at((0x0D*8)+2);
volatile       __bit	LCDIF		__at((0x0D*8)+4);
volatile       __bit	C1IF		__at((0x0D*8)+5);
volatile       __bit	C2IF		__at((0x0D*8)+6);
volatile       __bit	OSFIF		__at((0x0D*8)+7);

/* Definitions for T1CON register */
volatile	__bit	TMR1ON		__at((0x10*8)+0);
volatile	__bit	TMR1CS		__at((0x10*8)+1);
volatile	__bit	T1SYNC		__at((0x10*8)+2);
volatile	__bit	T1OSCEN		__at((0x10*8)+3);
volatile	__bit	T1CKPS0		__at((0x10*8)+4);
volatile	__bit	T1CKPS1		__at((0x10*8)+5);
volatile	__bit	T1GE		__at((0x10*8)+6);
volatile	__bit	T1GINV		__at((0x10*8)+7);

/* Definitions for T2CON register */
volatile	__bit	T2CKPS0		__at((0x12*8)+0);
volatile	__bit	T2CKPS1		__at((0x12*8)+1);
volatile	__bit	TMR2ON		__at((0x12*8)+2);
volatile	__bit	TOUTPS0		__at((0x12*8)+3);
volatile	__bit	TOUTPS1		__at((0x12*8)+4);
volatile	__bit	TOUTPS2		__at((0x12*8)+5);
volatile	__bit	TOUTPS3		__at((0x12*8)+6);

/* Definitions for SSPCON register */
volatile	__bit	SSPM0		__at((0x14*8)+0);
volatile	__bit	SSPM1		__at((0x14*8)+1);
volatile	__bit	SSPM2		__at((0x14*8)+2);
volatile	__bit	SSPM3		__at((0x14*8)+3);
volatile	__bit	CKP		__at((0x14*8)+4);
volatile	__bit	SSPEN		__at((0x14*8)+5);
volatile       __bit	SSPOV		__at((0x14*8)+6);
volatile       __bit	WCOL		__at((0x14*8)+7);

/* Definitions for CCP1CON register */
volatile	__bit	CCP1M0		__at((0x17*8)+0);
volatile	__bit	CCP1M1		__at((0x17*8)+1);
volatile	__bit	CCP1M2		__at((0x17*8)+2);
volatile	__bit	CCP1M3		__at((0x17*8)+3);
volatile       __bit	CCP1Y		__at((0x17*8)+4);
volatile       __bit	CCP1X		__at((0x17*8)+5);

/* Definitions for RCSTA register */
volatile       __bit	RX9D		__at((0x18*8)+0);
volatile       __bit	OERR		__at((0x18*8)+1);
volatile       __bit	FERR		__at((0x18*8)+2);
volatile	__bit	ADDEN		__at((0x18*8)+3);
volatile	__bit	CREN		__at((0x18*8)+4);
volatile	__bit	SREN		__at((0x18*8)+5);
volatile	__bit	RX9		__at((0x18*8)+6);
volatile	__bit	SPEN		__at((0x18*8)+7);

#if defined(_16F914) || defined(_16F917)
/* Definitions for CCP2CON register */
volatile	__bit	CCP2M0		__at((0x1D*8)+0);
volatile	__bit	CCP2M1		__at((0x1D*8)+1);
volatile	__bit	CCP2M2		__at((0x1D*8)+2);
volatile	__bit	CCP2M3		__at((0x1D*8)+3);
volatile       __bit	CCP2Y		__at((0x1D*8)+4);
volatile       __bit	CCP2X		__at((0x1D*8)+5);
#endif

/* Definitions for ADCON0 register */
volatile	__bit	ADON		__at((0x1F*8)+0);
volatile       __bit	GODONE		__at((0x1F*8)+1);
volatile	__bit	CHS0		__at((0x1F*8)+2);
volatile	__bit	CHS1		__at((0x1F*8)+3);
volatile	__bit	CHS2		__at((0x1F*8)+4);
volatile	__bit	VCFG0		__at((0x1F*8)+5);
volatile	__bit	VCFG1		__at((0x1F*8)+6);
volatile	__bit	ADFM		__at((0x1F*8)+7);

/* Definitions for OPTION register */
volatile	__bit	PS0		__at((0x81*8)+0);
volatile	__bit	PS1		__at((0x81*8)+1);
volatile	__bit	PS2		__at((0x81*8)+2);
volatile	__bit	PSA		__at((0x81*8)+3);
volatile	__bit	T0SE		__at((0x81*8)+4);
volatile	__bit	T0CS		__at((0x81*8)+5);
volatile	__bit	INTEDG		__at((0x81*8)+6);
volatile	__bit	RBPU		__at((0x81*8)+7);

/* Definitions for TRISA register */
volatile	__bit	TRISA0		__at((0x85*8)+0);
volatile	__bit	TRISA1		__at((0x85*8)+1);
volatile	__bit	TRISA2		__at((0x85*8)+2);
volatile	__bit	TRISA3		__at((0x85*8)+3);
volatile	__bit	TRISA4		__at((0x85*8)+4);
volatile	__bit	TRISA5		__at((0x85*8)+5);
volatile	__bit	TRISA6		__at((0x85*8)+6);
volatile	__bit	TRISA7		__at((0x85*8)+7);

/* Definitions for TRISB register */
volatile       __bit	TRISB0		__at((0x86*8)+0);
volatile       __bit	TRISB1		__at((0x86*8)+1);
volatile       __bit	TRISB2		__at((0x86*8)+2);
volatile       __bit	TRISB3		__at((0x86*8)+3);
volatile       __bit	TRISB4		__at((0x86*8)+4);
volatile       __bit	TRISB5		__at((0x86*8)+5);
volatile       __bit	TRISB6		__at((0x86*8)+6);
volatile       __bit	TRISB7		__at((0x86*8)+7);

/* Definitions for TRISC register */
volatile       __bit	TRISC0		__at((0x87*8)+0);
volatile       __bit	TRISC1		__at((0x87*8)+1);
volatile       __bit	TRISC2		__at((0x87*8)+2);
volatile       __bit	TRISC3		__at((0x87*8)+3);
volatile       __bit	TRISC4		__at((0x87*8)+4);
volatile       __bit	TRISC5		__at((0x87*8)+5);
volatile       __bit	TRISC6		__at((0x87*8)+6);
volatile       __bit	TRISC7		__at((0x87*8)+7);

#if defined(_16F914) || defined(_16F917)
/* Definitions for TRISD register */
volatile       __bit	TRISD0		__at((0x88*8)+0);
volatile       __bit	TRISD1		__at((0x88*8)+1);
volatile       __bit	TRISD2		__at((0x88*8)+2);
volatile       __bit	TRISD3		__at((0x88*8)+3);
volatile       __bit	TRISD4		__at((0x88*8)+4);
volatile       __bit	TRISD5		__at((0x88*8)+5);
volatile       __bit	TRISD6		__at((0x88*8)+6);
volatile       __bit	TRISD7		__at((0x88*8)+7);

/* Definitions for TRISE register */
volatile       __bit	TRISE0		__at((0x89*8)+0);
volatile       __bit	TRISE1		__at((0x89*8)+1);
volatile       __bit	TRISE2		__at((0x89*8)+2);
#endif
volatile       __bit	TRISE3		__at((0x89*8)+3);

/* Definitions for PIE1 register */
volatile	__bit	TMR1IE		__at((0x8C*8)+0);
volatile	__bit	TMR2IE		__at((0x8C*8)+1);
volatile	__bit	CCP1IE		__at((0x8C*8)+2);
volatile	__bit	SSPIE		__at((0x8C*8)+3);
volatile	__bit	TXIE		__at((0x8C*8)+4);
volatile	__bit	RCIE		__at((0x8C*8)+5);
volatile	__bit	ADIE		__at((0x8C*8)+6);
volatile	__bit	EEIE		__at((0x8C*8)+7);

/* Definitions for PIE2 register */
volatile	__bit	CCP2IE		__at((0x8D*8)+0);
volatile	__bit	LVDIE		__at((0x8D*8)+2);
volatile	__bit	LCDIE		__at((0x8D*8)+4);
volatile	__bit	C1IE		__at((0x8D*8)+5);
volatile	__bit	C2IE		__at((0x8D*8)+6);
volatile	__bit	OSFIE		__at((0x8D*8)+7);

/* Definitions for PCON register */
volatile       __bit	BOR		__at((0x8E*8)+0);
volatile       __bit	POR		__at((0x8E*8)+1);
volatile	__bit	SBOREN		__at((0x8E*8)+4);

/* Definitions for OSCCON register */
volatile	__bit	SCS		__at((0x8F*8)+0);
volatile       __bit	LTS		__at((0x8F*8)+1);
volatile       __bit	HTS		__at((0x8F*8)+2);
volatile       __bit	OSTS		__at((0x8F*8)+3);
volatile	__bit	IRCF0		__at((0x8F*8)+4);
volatile	__bit	IRCF1		__at((0x8F*8)+5);
volatile	__bit	IRCF2		__at((0x8F*8)+6);

/* Definitions for OSCTUNE register */
volatile	__bit	TUN0		__at((0x90*8)+0);
volatile	__bit	TUN1		__at((0x90*8)+1);
volatile	__bit	TUN2		__at((0x90*8)+2);
volatile	__bit	TUN3		__at((0x90*8)+3);
volatile	__bit	TUN4		__at((0x90*8)+4);

/* Definitions for ANSEL register */
volatile	__bit	ANS0		__at((0x91*8)+0);
volatile	__bit	ANS1		__at((0x91*8)+1);
volatile	__bit	ANS2		__at((0x91*8)+2);
volatile	__bit	ANS3		__at((0x91*8)+3);
volatile	__bit	ANS4		__at((0x91*8)+4);
volatile	__bit	ANS5		__at((0x91*8)+5);
volatile	__bit	ANS6		__at((0x91*8)+6);
volatile	__bit	ANS7		__at((0x91*8)+7);

/* Definitions for SSPSTAT register */
volatile       __bit	BF		__at((0x94*8)+0);
volatile       __bit	UA		__at((0x94*8)+1);
volatile       __bit	RW		__at((0x94*8)+2);
volatile       __bit	START		__at((0x94*8)+3);
volatile       __bit	STOP		__at((0x94*8)+4);
volatile       __bit	DA		__at((0x94*8)+5);
volatile	__bit	CKE		__at((0x94*8)+6);
volatile	__bit	SMP		__at((0x94*8)+7);

/* Definitions for IOCB register */
volatile	__bit	IOCB4		__at((0x96*8)+4);
volatile	__bit	IOCB5		__at((0x96*8)+5);
volatile	__bit	IOCB6		__at((0x96*8)+6);
volatile	__bit	IOCB7		__at((0x96*8)+7);

/* Definitions for CMCON1 register */
volatile	__bit	C2SYNC		__at((0x97*8)+0);
volatile	__bit	T1GSS		__at((0x97*8)+1);

