GopalSaraf/Practicals/PSDL/include/legacy/pic16f91x_legacy.h
/* Definitions for TXSTA register */
volatile       __bit	TX9D		__at((0x98*8)+0);
volatile       __bit	TRMT		__at((0x98*8)+1);
volatile	__bit	BRGH		__at((0x98*8)+2);
volatile	__bit	SYNC		__at((0x98*8)+4);
volatile	__bit	TXEN		__at((0x98*8)+5);
volatile	__bit	TX9		__at((0x98*8)+6);
volatile	__bit	CSRC		__at((0x98*8)+7);

/* Definitions for CMCON0 register */
volatile	__bit	CM0		__at((0x9C*8)+0);
volatile	__bit	CM1		__at((0x9C*8)+1);
volatile	__bit	CM2		__at((0x9C*8)+2);
volatile	__bit	CIS		__at((0x9C*8)+3);
volatile	__bit	C1INV		__at((0x9C*8)+4);
volatile	__bit	C2INV		__at((0x9C*8)+5);
volatile       __bit	C1OUT		__at((0x9C*8)+6);
volatile       __bit	C2OUT		__at((0x9C*8)+7);

/* Definitions for VRCON register */
volatile	__bit	VR0		__at((0x9D*8)+0);
volatile	__bit	VR1		__at((0x9D*8)+1);
volatile	__bit	VR2		__at((0x9D*8)+2);
volatile	__bit	VR3		__at((0x9D*8)+3);
volatile	__bit	VRR		__at((0x9D*8)+5);
volatile	__bit	VREN		__at((0x9D*8)+7);

/* Definitions for ADCON1 register */
volatile	__bit	ADCS0		__at((0x9F*8)+4);
volatile	__bit	ADCS1		__at((0x9F*8)+5);
volatile	__bit	ADCS2		__at((0x9F*8)+6);

/* Definitions for WDTCON register */
volatile	__bit	SWDTEN		__at((0x105*8)+0);
volatile	__bit	WDTPS0		__at((0x105*8)+1);
volatile	__bit	WDTPS1		__at((0x105*8)+2);
volatile	__bit	WDTPS2		__at((0x105*8)+3);
volatile	__bit	WDTPS3		__at((0x105*8)+4);

/* Definitions for LCDCON register */
volatile	__bit	LMUX0		__at((0x107*8)+0);
volatile	__bit	LMUX1		__at((0x107*8)+1);
volatile	__bit	CS0		__at((0x107*8)+2);
volatile	__bit	CS1		__at((0x107*8)+3);
volatile	__bit	VLCDEN		__at((0x107*8)+4);
volatile       __bit	WERR		__at((0x107*8)+5);
volatile	__bit	SLPEN		__at((0x107*8)+6);
volatile	__bit	LCDEN		__at((0x107*8)+7);

/* Definitions for LCDPS register */
volatile	__bit	LP0		__at((0x108*8)+0);
volatile	__bit	LP1		__at((0x108*8)+1);
volatile	__bit	LP2		__at((0x108*8)+2);
volatile	__bit	LP3		__at((0x108*8)+3);
volatile       __bit	WA		__at((0x108*8)+4);
volatile       __bit	LCDA		__at((0x108*8)+5);
volatile	__bit	BIASMD		__at((0x108*8)+6);
volatile	__bit	WFT		__at((0x108*8)+7);

/* Definitions for LVDCON register */
volatile	__bit	LVDL0		__at((0x109*8)+0);
volatile	__bit	LVDL1		__at((0x109*8)+1);
volatile	__bit	LVDL2		__at((0x109*8)+2);
volatile	__bit	LVDEN		__at((0x109*8)+4);
volatile       __bit	IRVST		__at((0x109*8)+5);

/* Definitions for LCDDATA0 register */
volatile	__bit	SEG0COM0	__at((0x110*8)+0);
volatile	__bit	SEG1COM0	__at((0x110*8)+1);
volatile	__bit	SEG2COM0	__at((0x110*8)+2);
volatile	__bit	SEG3COM0	__at((0x110*8)+3);
volatile	__bit	SEG4COM0	__at((0x110*8)+4);
volatile	__bit	SEG5COM0	__at((0x110*8)+5);
volatile	__bit	SEG6COM0	__at((0x110*8)+6);
volatile	__bit	SEG7COM0	__at((0x110*8)+7);

/* Definitions for LCDDATA1 register */
volatile	__bit	SEG8COM0	__at((0x111*8)+0);
volatile	__bit	SEG9COM0	__at((0x111*8)+1);
volatile	__bit	SEG10COM0	__at((0x111*8)+2);
volatile	__bit	SEG11COM0	__at((0x111*8)+3);
volatile	__bit	SEG12COM0	__at((0x111*8)+4);
volatile	__bit	SEG13COM0	__at((0x111*8)+5);
volatile	__bit	SEG14COM0	__at((0x111*8)+6);
volatile	__bit	SEG15COM0	__at((0x111*8)+7);

#if defined(_16F914) || defined(_16F917)
/* Definitions for LCDDATA2 register */
volatile	__bit	SEG16COM0	__at((0x112*8)+0);
volatile	__bit	SEG17COM0	__at((0x112*8)+1);
volatile	__bit	SEG18COM0	__at((0x112*8)+2);
volatile	__bit	SEG19COM0	__at((0x112*8)+3);
volatile	__bit	SEG20COM0	__at((0x112*8)+4);
volatile	__bit	SEG21COM0	__at((0x112*8)+5);
volatile	__bit	SEG22COM0	__at((0x112*8)+6);
volatile	__bit	SEG23COM0	__at((0x112*8)+7);
#endif

/* Definitions for LCDDATA3 register */
volatile	__bit	SEG0COM1	__at((0x113*8)+0);
volatile	__bit	SEG1COM1	__at((0x113*8)+1);
volatile	__bit	SEG2COM1	__at((0x113*8)+2);
volatile	__bit	SEG3COM1	__at((0x113*8)+3);
volatile	__bit	SEG4COM1	__at((0x113*8)+4);
volatile	__bit	SEG5COM1	__at((0x113*8)+5);
volatile	__bit	SEG6COM1	__at((0x113*8)+6);
volatile	__bit	SEG7COM1	__at((0x113*8)+7);

/* Definitions for LCDDATA4 register */
volatile	__bit	SEG8COM1	__at((0x114*8)+0);
volatile	__bit	SEG9COM1	__at((0x114*8)+1);
volatile	__bit	SEG10COM1	__at((0x114*8)+2);
volatile	__bit	SEG11COM1	__at((0x114*8)+3);
volatile	__bit	SEG12COM1	__at((0x114*8)+4);
volatile	__bit	SEG13COM1	__at((0x114*8)+5);
volatile	__bit	SEG14COM1	__at((0x114*8)+6);
volatile	__bit	SEG15COM1	__at((0x114*8)+7);

#if defined(_16F914) || defined(_16F917)
/* Definitions for LCDDATA5 register */
volatile	__bit	SEG16COM1	__at((0x115*8)+0);
volatile	__bit	SEG17COM1	__at((0x115*8)+1);
volatile	__bit	SEG18COM1	__at((0x115*8)+2);
volatile	__bit	SEG19COM1	__at((0x115*8)+3);
volatile	__bit	SEG20COM1	__at((0x115*8)+4);
volatile	__bit	SEG21COM1	__at((0x115*8)+5);
volatile	__bit	SEG22COM1	__at((0x115*8)+6);
volatile	__bit	SEG23COM1	__at((0x115*8)+7);
#endif

/* Definitions for LCDDATA6 register */
volatile	__bit	SEG0COM2	__at((0x116*8)+0);
volatile	__bit	SEG1COM2	__at((0x116*8)+1);
volatile	__bit	SEG2COM2	__at((0x116*8)+2);
volatile	__bit	SEG3COM2	__at((0x116*8)+3);
volatile	__bit	SEG4COM2	__at((0x116*8)+4);
volatile	__bit	SEG5COM2	__at((0x116*8)+5);
volatile	__bit	SEG6COM2	__at((0x116*8)+6);
volatile	__bit	SEG7COM2	__at((0x116*8)+7);

/* Definitions for LCDDATA7 register */
volatile	__bit	SEG8COM2	__at((0x117*8)+0);
volatile	__bit	SEG9COM2	__at((0x117*8)+1);
volatile	__bit	SEG10COM2	__at((0x117*8)+2);
volatile	__bit	SEG11COM2	__at((0x117*8)+3);
volatile	__bit	SEG12COM2	__at((0x117*8)+4);
volatile	__bit	SEG13COM2	__at((0x117*8)+5);
volatile	__bit	SEG14COM2	__at((0x117*8)+6);
volatile	__bit	SEG15COM2	__at((0x117*8)+7);

#if defined(_16F914) || defined(_16F917)
/* Definitions for LCDDATA8 register */
volatile	__bit	SEG16COM2	__at((0x118*8)+0);
volatile	__bit	SEG17COM2	__at((0x118*8)+1);
volatile	__bit	SEG18COM2	__at((0x118*8)+2);
volatile	__bit	SEG19COM2	__at((0x118*8)+3);
volatile	__bit	SEG20COM2	__at((0x118*8)+4);
volatile	__bit	SEG21COM2	__at((0x118*8)+5);
volatile	__bit	SEG22COM2	__at((0x118*8)+6);
volatile	__bit	SEG23COM2	__at((0x118*8)+7);
#endif

/* Definitions for LCDDATA9 register */
volatile	__bit	SEG0COM3	__at((0x119*8)+0);
volatile	__bit	SEG1COM3	__at((0x119*8)+1);
volatile	__bit	SEG2COM3	__at((0x119*8)+2);
volatile	__bit	SEG3COM3	__at((0x119*8)+3);
volatile	__bit	SEG4COM3	__at((0x119*8)+4);
volatile	__bit	SEG5COM3	__at((0x119*8)+5);
volatile	__bit	SEG6COM3	__at((0x119*8)+6);
volatile	__bit	SEG7COM3	__at((0x119*8)+7);

