GopalSaraf/Practicals/PSDL/include/legacy/pic16f91x_legacy.h
/* Definitions for LCDDATA10 register */
volatile	__bit	SEG8COM3	__at((0x11A*8)+0);
volatile	__bit	SEG9COM3	__at((0x11A*8)+1);
volatile	__bit	SEG10COM3	__at((0x11A*8)+2);
volatile	__bit	SEG11COM3	__at((0x11A*8)+3);
volatile	__bit	SEG12COM3	__at((0x11A*8)+4);
volatile	__bit	SEG13COM3	__at((0x11A*8)+5);
volatile	__bit	SEG14COM3	__at((0x11A*8)+6);
volatile	__bit	SEG15COM3	__at((0x11A*8)+7);

#if defined(_16F914) || defined(_16F917)
/* Definitions for LCDDATA11 register */
volatile	__bit	SEG16COM3	__at((0x11B*8)+0);
volatile	__bit	SEG17COM3	__at((0x11B*8)+1);
volatile	__bit	SEG18COM3	__at((0x11B*8)+2);
volatile	__bit	SEG19COM3	__at((0x11B*8)+3);
volatile	__bit	SEG20COM3	__at((0x11B*8)+4);
volatile	__bit	SEG21COM3	__at((0x11B*8)+5);
volatile	__bit	SEG22COM3	__at((0x11B*8)+6);
volatile	__bit	SEG23COM3	__at((0x11B*8)+7);
#endif

/* Definitions for LCDSE0 register */
volatile	__bit	SE0		__at((0x11C*8)+0);
volatile	__bit	SE1		__at((0x11C*8)+1);
volatile	__bit	SE2		__at((0x11C*8)+2);
volatile	__bit	SE3		__at((0x11C*8)+3);
volatile	__bit	SE4		__at((0x11C*8)+4);
volatile	__bit	SE5		__at((0x11C*8)+5);
volatile	__bit	SE6		__at((0x11C*8)+6);
volatile	__bit	SE7		__at((0x11C*8)+7);

/* Definitions for LCDSE1 register */
volatile	__bit	SE8		__at((0x11D*8)+0);
volatile	__bit	SE9		__at((0x11D*8)+1);
volatile	__bit	SE10		__at((0x11D*8)+2);
volatile	__bit	SE11		__at((0x11D*8)+3);
volatile	__bit	SE12		__at((0x11D*8)+4);
volatile	__bit	SE13		__at((0x11D*8)+5);
volatile	__bit	SE14		__at((0x11D*8)+6);
volatile	__bit	SE15		__at((0x11D*8)+7);

/* Definitions for LCDSE2 register */
volatile	__bit	SE16		__at((0x11E*8)+0);
volatile	__bit	SE17		__at((0x11E*8)+1);
volatile	__bit	SE18		__at((0x11E*8)+2);
volatile	__bit	SE19		__at((0x11E*8)+3);
volatile	__bit	SE20		__at((0x11E*8)+4);
volatile	__bit	SE21		__at((0x11E*8)+5);
volatile	__bit	SE22		__at((0x11E*8)+6);
volatile	__bit	SE23		__at((0x11E*8)+7);

/* Definitions for EECON1 register */
volatile       __bit	RD		__at((0x18C*8)+0);
volatile       __bit	WR		__at((0x18C*8)+1);
volatile       __bit	WREN		__at((0x18C*8)+2);
volatile       __bit	WRERR		__at((0x18C*8)+3);
volatile       __bit	EEPGD		__at((0x18C*8)+7);

#define CONFIG_ADDR	0x2007

/*
 * Definitions for library compatibility
 */
typedef union {
    struct {
        unsigned C                      :1;
        unsigned DC                     :1;
        unsigned Z                      :1;
        unsigned nPD                    :1;
        unsigned nTO                    :1;
        unsigned RP                     :2;
        unsigned IRP                    :1;
    };
    struct {
        unsigned                        :5;
        unsigned RP0                    :1;
        unsigned RP1                    :1;
    };
    struct {
        unsigned CARRY                  :1;
        unsigned                        :1;
        unsigned ZERO                   :1;
    };
} STATUSbits_t;
extern volatile STATUSbits_t STATUSbits __at(0x003);
typedef union {
    struct {
        unsigned RBIF                   :1;
        unsigned INTF                   :1;
        unsigned TMR0IF                 :1;
        unsigned RBIE                   :1;
        unsigned INTE                   :1;
        unsigned TMR0IE                 :1;
        unsigned PEIE                   :1;
        unsigned GIE                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned T0IF                   :1;
        unsigned                        :2;
        unsigned T0IE                   :1;
    };
} INTCONbits_t;
extern volatile INTCONbits_t INTCONbits __at(0x00B);
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned                        :3;
        unsigned EEPGD                  :1;
    };
    struct {
        unsigned EERD                   :1;
        unsigned EEWR                   :1;
    };
} EECON1bits_t;
extern volatile EECON1bits_t EECON1bits __at(0x18C);

#endif
